Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean,Autodesk.Revit.DB.XYZ)
Creates a non rectangular profile wall within the project using the specified wall type and normal vector.
document:
The document in which the new wall is created.
profile:
An array of planar lines and arcs that represent the vertical profile of the wall.
wallTypeId:
Id of the wall type to be used by the new wall instead of the default type.
levelId:
Id of the level on which the wall is to be placed.
structural:
If set, specifies that the wall is structural in nature.
normal:
A vector that must be perpendicular to the profile which dictates which side of the wall is considered to be inside and outside.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profile contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the wall.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean)
Creates a non rectangular profile wall within the project using the specified wall type.
document:
The document in which the new wall is created.
profile:
An array of planar lines and arcs that represent the vertical profile of the wall.
wallTypeId:
Id of the wall type to be used by the new wall instead of the default type.
levelId:
Id of the level on which the wall is to be placed.
structural:
If set, specifies that the wall is structural in nature.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profile contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the wall.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.Curve},System.Boolean)
Creates a non rectangular profile wall within the project using the default wall type.
document:
The document in which the new wall is created.
profile:
An array of planar lines and arcs that represent the vertical profile of the wall.
structural:
If set, specifies that the wall is structural in nature.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profile contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the wall.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.